NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/lagrangian/reactingParcelFoam/filter/constant/reactions
species
(
    N2
    O2
    H2O
);

reactions
{}
